# ___________________________________________________________
# ЕТАП 1: РОЗРОБКА БАЗОВОЇ СТРУКТУРИ ТА ОПЕРАЦІЙ
# Виконала: [Литвиненко Анастасія] (Роль: Студентка 1 - Тімлід)
# ___________________________________________________________

# Шаблон для заповнювання словника
template = {
    'Група': '',
    'ПІБ': '',
    'Курс': 0,
    'Предмет': '',
    'Оцінка': 0
}

# Основний список, що зберігає словники студентів
students = []

# Функція для додавання інформації по учнях
def adding(template, students):
    for i in range(int(input('Кількість студентів: '))):
        print('\nДані студента номер ', i + 1, ': \n')
        student = template.copy() 

        student['Група'] = input('Введіть групу студента: ')
        student['ПІБ'] = input('Введіть прізвище, ім\'я та по-батькові студента: ')
        student['Курс'] = int(input('Введіть курс студента: '))
        student['Предмет'] = input('Введіть назву предмету: ')
        student['Оцінка'] = int(input('Введіть оцінку: '))

        students.append(student)
        print('Студента', i + 1, 'додано успішно! \n')
        print()


# ___________________________________________________________________________
# ЕТАП 2: АНАЛІЗ, ВИВЕДЕННЯ ТА ВИДАЛЕННЯ ДАНИХ
# Виконала: Литвиненко Анастасія (Роль: Студентка 2 - Наступниця)
# 
# ХАРАКТЕРИСТИКА ТА АНАЛІЗ СЛОВНИКА ВІД СТУДЕНТКИ 2:
# Структура словника, створена Студенткою 1, є повністю робочою та зрозумілою. 
# Вона оптимальна для збереження однієї оцінки з одного конкретного предмета.
# Змінювати структуру словника на цьому етапі немає гострої необхідності, 
# оскільки вона повністю задовольняє вимоги поточної лабораторної роботи.
# Відповідно до поставленої задачі, додано функцію виведення даних на екран 
# та функцію видалення конкретного студента з бази даних.
#____________________________________________________________________________

# Функція виведення усіх учнів на екран (Додано Студенткою 2)    
def printing(students):
    if not students:
        print('Список студентів порожній. Спочатку додайте когось.')
        return
    for i in range(len(students)):
        print()
        print (f'Студент {i + 1}: ')
        for key in students[i]:
            print(f'{key}: {students[i][key]}')
    # ВИПРАВЛЕНО: Видалено рекурсивний виклик main_menu

# Функція для видалення конкретного учня (Додано Студенткою 2)
def delete(index, students):
    if 0 <= index < len(students):
        del students[index]
        print('Студент видалений успішно!')
    else:
        print('Помилка, немає студента під таким номером')
    # ВИПРАВЛЕНО: Видалено рекурсивний виклик main_menu


# Головне меню, яке координує роботу програми (Модернізовано Студенткою 2)
def main_menu(template, students):
    while True:
        print('\nОберіть дію:')
        print('1) Додати учня')
        print('2) Вивести усіх учнів на екран')  # Пункт додано Студенткою 2
        print('3) Видалити студента')            # Пункт додано Студенткою 2
        print('4) Вихід')
        
        n = int(input('Введіть номер дії: '))
        print()
    
        match n:
            case 1: 
                adding(template, students)
            case 2: 
                printing(students)
            case 3: 
                if not students:
                    print('Список порожній, нікого видаляти.')
                else:
                    num = int(input('Введіть номер учня для видалення: ')) - 1
                    delete(num, students)
            case 4:
                print('Завершення програми...')
                break
            case _:
                print('Неправильний пункт меню, спробуйте ще раз.') # додано перевірку на неправильне значення дії (Студентка 2)


if __name__ == '__main__':
    main_menu(template, students)