# ___________________________________________________________
# ЕТАП 1: РОЗРОБКА БАЗОВОЇ СТРУКТУРИ ТА ОПЕРАЦІЙ
# Виконала: [Литвиненко Анастасія] (Роль: Студентка 1 - Тімлід)
# ___________________________________________________________

# Шаблон для заповнювання словника
template = {
    'Група': '',
    'ПІБ': '',
    'Курс': 0,
    'Предмет': '',
    'Оцінка': 0
}

# Основний список, що зберігає словники студентів
students = []

# Функція для додавання інформації по учнях
def adding(template, students):
    for i in range(int(input('Кількість студентів: '))):
        print('\nДані студента номер ', i + 1, ': \n')
        student = template.copy() 

        student['Група'] = input('Введіть групу студента: ')
        student['ПІБ'] = input('Введіть прізвище, ім\'я та по-батькові студента: ')
        student['Курс'] = int(input('Введіть курс студента: '))
        student['Предмет'] = input('Введіть назву предмету: ')
        student['Оцінка'] = int(input('Введіть оцінку: '))

        students.append(student)
        print('Студента', i + 1, 'додано успішно! \n')
        print()


# Головне меню, яке координує роботу програми
def main_menu(template, students):
    while True:
        print('\nОберіть дію:')
        print('1) Додати учня')
        print('2) Вихід')
        
        n = int(input('Введіть номер дії: '))
        print()
    
        match n:
            case 1: adding(template, students)
            case 2:
                print('Завершення програми...')
                break


if __name__ == '__main__':
    main_menu(template, students)